jabeja/id2222/runs.tex
% Created 2017-12-07 tor 12:55
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\author{Kim Hammar}
\date{\today}
\title{runs}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 25.2.2 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\tableofcontents

\section{Test runs}
\label{sec-1}


\section{Task 1 - Linear Simulated Annealing, no restarts, no randomness}
\label{sec-2}

Example command:
\begin{verbatim}
./run.sh -graph ./graphs/3elt.graph -rounds 1000 -numPartitions 4 -temp 2 -delta 0.003 -alpha 2 -nodeSelectionPolicy HYBRID
\end{verbatim}

\begin{center}
\begin{tabular}{lrrrrrrrlrl}
graph & delta & T & edge-cut & rounds & swaps & migrations & partitions & converge & alpha & policy\\
\hline
add20 & 0.003 & 2 & 2095 & 1000 & 1090263 & 1751 & 4 & yes & 2 & hybrid\\
3elt & 0.003 & 2 & 2604 & 1000 & 1580209 & 3328 & 4 & yes & 2 & hybrid\\
twitter & 0.003 & 2 & 41156 & 1000 & 899515 & 2049 & 4 & yes & 2 & hybrid\\
\end{tabular}
\end{center}

\section{Task 2.1 - Linear Simulated annealing, no restarts, randomness and acceptance probability}
\label{sec-3}

Example command:

\begin{verbatim}
./run.sh -graph ./graphs/add20.graph -rounds 1000 -numPartitions 4 -temp 1 -delta 0.003 -alpha 2 -nodeSelectionPolicy HYBRID
\end{verbatim}
\begin{center}
\begin{tabular}{lrrrrrrrlrl}
graph & delta & T & edge-cut & rounds & swaps & migrations & partitions & converge & alpha & policy\\
\hline
3elt & 0.003 & 1 & 2190 & 1000 & 103586 & 3274 & 4 & yes & 2 & hybrid\\
add20 & 0.003 & 1 & 2060 & 1000 & 373826 & 1745 & 4 & yes & 2 & hybrid\\
twitter & 0.003 & 1 & 41115 & 1000 & 48804 & 2046 & 4 & yes & 2 & hybrid\\
\end{tabular}
\end{center}

\section{Task 2.2 - Linear Simulated annealing with restarts, randomness and acceptance probability}
\label{sec-4}

Example command:
\begin{verbatim}
./run.sh -graph ./graphs/add20.graph -rounds 1000 -numPartitions 4 -temp 1 -delta 0.003 -restart 0.000001 -alpha 2 -nodeSelectionPolicy HYBRID
\end{verbatim}
\begin{center}
\begin{tabular}{lrrrrrrrlrlr}
graph & delta & T & edge-cut & rounds & swaps & migrations & partitions & converge & alpha & policy & restart\\
\hline
3elt & 0.003 & 1 & 2037 & 1000 & 4463446 & 3296 & 4 & no & 2 & hybrid & 1\\
add20 & 0.003 & 1 & 2348 & 1000 & 2303961 & 1746 & 4 & no & 2 & hybrid & 1\\
twitter & 0.003 & 1 & 41147 & 1000 & 2494681 & 2049 & 4 & yes & 2 & hybrid & 1\\
\end{tabular}
\end{center}

\section{Task 2.3 Exponential simulated annealing with restarts, randomness and acceptance probability}
\label{sec-5}
Example command:

\begin{verbatim}
./run.sh -graph ./graphs/add20.graph -rounds 1000 -numPartitions 4 -temp 1 -delta 0.003 -restart 0.000001 -alpha 2 -nodeSelectionPolicy HYBRID
\end{verbatim}
\begin{center}
\begin{tabular}{lrrrrrrrlrlr}
graph & delta & T & edge-cut & rounds & swaps & migrations & partitions & converge & alpha & policy & restart\\
\hline
3elt & 0.003 & 1 & 2504 & 1000 & 4713193 & 3328 & 4 & no & 2 & hybrid & 1\\
add20 & 0.003 & 1 & 2471 & 1000 & 2392641 & 1679 & 4 & no & 2 & hybrid & 1\\
twitter & 0.003 & 1 & 41327 & 1000 & 2636468 & 2045 & 4 & yes & 2 & hybrid & 1\\
\end{tabular}
\end{center}

\section{Task 2.4 Exponential simulated annealing with restarts, randomness and acceptance probability - Parameter tuning}
\label{sec-6}
Example command:

\begin{verbatim}
./run.sh -graph ./graphs/add20.graph -rounds 1000 -numPartitions 4 -temp 1 -delta 0.003 -restart 0.000001 -alpha 2 -nodeSelectionPolicy HYBRID
\end{verbatim}
\begin{center}
\begin{tabular}{lrrrrrrrlrlr}
graph & delta & T & edge-cut & rounds & swaps & migrations & partitions & converge & alpha & policy & restart\\
\hline
3elt & 0.00001 & 1 & 1021 & 10000 & 42010302 & 3441 & 4 & no & 2 & hybrid & 1\\
3elt & 0.00001 & 1 & 1208 & 10000 & 42541398 & 3425 & 4 & no & 1 & hybrid & 1\\
3elt & 0.003 & 1 & 1011 & 10000 & 44596460 & 3422 & 4 & no & 2 & hybrid & 1\\
3elt & 0.003 & 1 & 731 & 50000 & 222928227 & 3435 & 4 & yes & 2 & hybrid & 1\\
add20 & 0.00001 & 1 & 2196 & 10000 & 22126510 & 1753 & 4 & no & 2 & hybrid & 1\\
add20 & 0.00001 & 1 & 1792 & 10000 & 21773341 & 1757 & 4 & yes & 1 & hybrid & 1\\
add20 & 0.003 & 1 & 1780 & 10000 & 22704110 & 1734 & 4 & yes & 1 & hybrid & 1\\
twitter & 0.00001 & 1 & 41258 & 2000 & 4739316 & 2046 & 4 & yes & 2 & hybrid & 1\\
twitter & 0.003 & 1 & 40841 & 2000 & 5000891 & 2043 & 4 & yes & 1 & hybrid & 1\\
\end{tabular}
\end{center}

\section{Bonus Momentum + Simulated Annealing}
\label{sec-7}
Example command:

\begin{verbatim}
./run.sh -graph ./graphs/twitter.graph -rounds 1000 -numPartitions 4 -temp 1 -delta 0.003 -alpha 1 -nodeSelectionPolicy HYBRID -momentum 0.001
\end{verbatim}
\begin{center}
\begin{tabular}{lrrrrrrrlrlr}
graph & delta & T & edge-cut & rounds & swaps & migrations & partitions & converge & alpha & policy & momentum\\
\hline
3elt & 0.003 & 1 & 1256 & 1000 & 4280889 & 3420 & 4 & no & 2 & hybrid & 0.001\\
3elt & 0.003 & 1 & 5139 & 1000 & 4685823 & 3535 & 4 & no & 2 & hybrid & 10\\
3elt & 0.003 & 1 & 1344 & 1000 & 4281498 & 3397 & 4 & no & 2 & hybrid & 0.0001\\
3elt & 0.003 & 1 & 697 & 10000 & 42315849 & 3457 & 4 & no & 2 & hybrid & 0.001\\
3elt & 0.003 & 1 & 518 & 50000 & 210569840 & 3463 & 4 & yes & 2 & hybrid & 0.001\\
add20 & 0.003 & 1 & 2095 & 1000 & 2294945 & 1815 & 4 & no & 2 & hybrid & 0.001\\
add20 & 0.003 & 1 & 1997 & 10000 & 22776283 & 1785 & 4 & yes & 1 & hybrid & 0.00001\\
twitter & 0.003 & 1 & 41137 & 1000 & 2485027 & 2034 & 4 & yes & 2 & hybrid & 0.001\\
twitter & 0.003 & 1 & 40878 & 1000 & 2498748 & 2035 & 4 & yes & 1 & hybrid & 0.001\\
twitter & 0.003 & 1 & 40833 & 1000 & 2488748 & 2041 & 4 & yes & 1 & hybrid & 0.0001\\
twitter & 0.003 & 1 & 41436 & 1000 & 2490911 & 2068 & 4 & yes & 1 & hybrid & 0.00001\\
\end{tabular}
\end{center}
% Emacs 25.2.2 (Org mode 8.2.10)
\end{document}
